# Task #2
# Написати програму, яка буде пропонувати користувачу ввести певне число.
# У відповідь на введене число, програма має виводити в консоль задане число помножене на 256 та пропонувати ввести ще одне число.
# Наведена вище логіка має повторюватись безліч кількість разів.
# У випадку, якщо програма отримала число, яке містить у своєму записі більше ніж одну одиницю (1),
# потрібно вивести користувачу якесь довільне повідомлення про завершення виконання цієї програми та зупинити програму.
#
# Приклад взаємодії користувача з цією програмою:
# Введіть число:
# 1
# Результат виконання: 256
# Введіть число:
# 171
# Умови недотримані, зупиняю виконання програми.


loop do |variable| 												# створюємо безкінечний цикл, виконуватиметься до настання певної умови
	puts 'Enter any number: ' 									# просимо користувача ввести число
	number = gets.chomp 										# створюємо змінну number, значення якої беремо з консолі
	if number.count('1') <= 1 && number == "#{number.to_i}"		# за домомогою методу count перевіряємо співпадіння у введеній строці та заданій умові (більше двох 1)
		puts "The result of execution: #{number.to_i * 256}" 	# якщо умова виконана - виводимо результат, помножений на 256
	else
		puts "Conditions are not met, I stop the program"		# якщо умови недотримані - виводимо повідомлення
		break													# та за допомогою break завершуємо цикл
	end
end